<!DOCTYPE html>
<html>
    <head>
        <title></title>
        <meta http-equiv='Content-Type' content='text/html; charset=UTF-8'>
    </head>

    <body style="background:#F4EFEF;">

    <div style="margin:24px 34px;">

        <h1>Registrar asistencia ha Consulta</h1>
<font size="6" >
<p align="justify"> La ventana Registrar Consulta contiene un <b><i>panel izquierdo</i></b> con un calendario que al seleccionar un d&iacute;a se completa una tabla con los turnos de la fecha seleccionada, tambi&eacute;n se puede presionar el bot&oacute;n "Buscar Turno" y encontrarlos por paciente, por fecha o un rango de fechas. Al presionar el bot&oacute;n "Cancelar b&uacute;squeda" se cierra el panel Buscar Turnos. El bot&oacute;n "Asignar Nuevo Turno" llama a la ventana con ese mismo nombre y el bot&oacute;n "Agenda Tel." llama a la ventana con los datos de contacto de los pacientes. El <b><i>panel derecho</i></b> de esta ventana contiene informaci&oacute;n del turno seleccionado de la tabla "Detalles de Tunos", si se quiere modicar o agregar nuevos datos del turno se debe presionar el bot&oacute;n "Editar", al seleccionar el bot&oacute;n "Cancelar" se borrara cualquier modificaci&oacute;n realizada. El bot&oacute;n "Guardar" actualizara los datos modificados.
</p>      
        <p><center><img src="consulta.gif" width="696" height="462"></center></p>

<p align="justify">Las pesta&ntilde;as Paciente y Turno del panel izquierdo no se pueden modificar pero las dem&aacute;s pesta&ntilde;as si, al igual que el campo "Observaciones" y los estados del turno. Si estos estados tienen una tilde equivale a un "Si" como lo muestra el ejemplo: Paciente si asistio, si abono el turno y no cancelo el turno.</p> 
</font> 

	<br><hr>
	<h2>Ejemplo de motivo</h2>

<font size="6" >
<p align="justify"> 
Para editar el Motivo de consulta se debe seleccionar el bot&oacute;n "Seleccionar Motivo" aparecer&aacute; el panel de Buscar, seleccionamos el tipo de b&uacute;squeda (por n&uacute;mero o por nombre), si la b&uacute;squeda arrojo resultados la tabla los mostrara. Seleccionamos un Motivo de la tabla, aparecer&aacute; un mensaje preguntando si seleccionamos ese motivo, respondemos si y luego presionamos el bot&oacute;n "Confirmar selecci&oacute;n" y el Motivo ser&aacute; correctamente seleccionado.
</p> 
</font>
	<p><center><img src="motivo.gif" width="537" height="286"></center></p>


	<br><hr>
	<h2>Ejemplo de prueba</h2>

<font size="6" >
<p align="justify"> 
Para editar la Prueba de consulta se debe seleccionar el bot&oacute;n "Seleccionar Prueba" aparecer&aacute; el panel de Buscar, seleccionamos el tipo de b&uacute;squeda (por n&uacute;mero o por nombre), si la b&uacute;squeda arrojo resultados la tabla los mostrar&aacute;. Seleccionamos una Prueba de la tabla, aparecer&aacute; un mensaje preguntando si seleccionamos esa Prueba, respondemos si y luego presionamos el bot&oacute;n "Confirmar selecci&oacute;n", la Prueba ser&aacute; correctamente seleccionado y se podr&aacute; escribir en el campo "Resultado".
</p> 
</font>

	<p><center><img src="prueba.gif" width="537" height="287"></center></p>

	<br><hr>
	<h2>Ejemplo de diagn&oacute;stico</h2>

<font size="6" >
<p align="justify"> Para editar o agregar un Diagn&oacute;stico debe selecionar el bot&oacute;n "Ingrese Diagn&oacute;stico", se habilitar&aacute el panel para hacer clic sobre el combo y elegir del listado un diagn&oacute;stico y agregar un descripci&oacute;n. Al selecionar el bot&oacute;n "Cancelar Ingreso" se borraran las modificaciones realizadas.
</p> 
</font>
	<p><center><img src="diagnostico.gif" width="537" height="287"</center></p>


	<br><hr>
	<h2>Ejemplo de tratamiento</h2>

<font size="6" >
<p align="justify">Para editar o agregar un Tratamiento debe selecionar el bot&oacute;n "Ingrese Tratamiento", se habilitar&aacute el panel para hacer clic sobre el combo y elegir del listado un tratamiento y agregar un descripci&oacute;n. Al selecionar el bot&oacute;n "Cancelar Ingreso" se borraran las modificaciones realizadas. 
</p> 
</font>

	<p><center><img src="tratamiento.gif" width="539" height="289"></center></p>


      </div>
    </body>
</html>