<!DOCTYPE html>
<html>
    <head>
        <title></title>
        <meta http-equiv='Content-Type' content='text/html; charset=UTF-8'>
    </head>
    <body style="background:#F4EFEF;">
    <div style="margin:24px 34px;">

        <h1>Administrar Diagn&oacute;sticos</h1>

<font size="6">

<p align="justify">
Esta ventana llamada "Administrar Diagn&oacute;sticos" contiene un panel de b&uacute;squeda por n&uacute;mero o nombre de diagn&oacute;stico, un panel para registrar nuevo diagn&oacute;stico y un panel de botones.</p>  
      
        <p><center><img src="diagtodo.PNG" width="739" height="495"></center></p>

<p align="justify">Al presionar el bot&oacute;n "Nuevo" se oculta el panel de b&uacute;squeda y se habilita el campo nombre para ingresar un nuevo diagn&oacute;stico, luego se presiona el bot&oacute;n "Guardar" para registrar el dato ingresado.</p>
	
	<p><center><img src="diagnuevo.PNG" width="744" height="285"></center></p>

<p align="justify">El bot&oacute;n "Cancelar" borra lo ingresado en el campo nombre y aparece el panel b&uacute;squeda. </p>

<p align="justify">
	Para realizar una b&uacute;squeda de un diagn&oacute;stico se debe seleccionar una opci&oacute;n de b&uacute;squeda, estas son por n&uacute;mero o por nombre de diagn&oacute;stico y presionar el bot&oacute;n "Buscar", si la b&uacute;squeda arrojo resultados se completara la tabla con los mismos.</p>

	<p align="justify">Para editar o eliminar una ocupaci&oacute;n o profesi&oacute;n se debe buscar y seleccionar con doble clic la que se desea modificar o eliminar. El bot&oacute;n "editar" habilita el campo nombre para modificar su contenido y el bot&oacute;n "eliminar" borra el registro seleccionado. </p>

	<p><center><img src="diageditelim.PNG" width="742" height="498"></center></p>

<p align="justify">Al presionar el bot&oacute;n "Informe" aparece la siguiente ventana que nos permite obtener un listado con todas los diagn&oacute;stico registradas o filtrar el listado seg&uacute;n una descripci&oacute;n.</p>

<p align="justify">
Los datos requeridos para generar el listado son <i><b>Ordenar por</b></i> un campo que se mostrara en el listado, el <i><b>tipo de ordenamiento</b></i> del campo elegido y la cantidad de registros ha <i><b>mostrar</b></i>.
</p>

	<p><center><img src="ocupacionlistado.png" width="546" height="486"></center></p>

<p align="justify">Al seleccionar el bot&oacute;n "Ver" aparece el listado. En el siguiente ejemplo no se ha filtrado el listado por una descripci&oacute;n.</p>
	
	<p><center><img src="diaglist.PNG" width="1000" height="697"></center></p>

</font>
	</div>
    </body>
</html>