<!DOCTYPE html>
<html>
    <head>
        <title></title>
        <meta http-equiv='Content-Type' content='text/html; charset=UTF-8'>
    </head>
    <body style="background:#F4EFEF;">
    <div style="margin:24px 34px;">

        <h1>Administrar Ocupaciones/Profesiones</h1>  
      
<font size="6">       
        <p align="justify">
Esta ventana llamada "Registrar Nueva ocupaci&oacute;n/Profesi&oacute;n" posee un panel de b&uacute;squeda por n&uacute;mero o nombre de la ocupaci&oacute;n o profeci&oacute;n, un panel para registrar nueva ocupaci&oacute;n o profeci&oacute;n y un panel de botones.</p>

        <p><center><img src="ocupacion.png" height="524" width="742"></center></p>

        <p align="justify">Al presionar el bot&oacute;n "Nuevo" se oculta el panel de b&uacute;squeda y se habilita el campo nombre para ingresar la nueva ocupaci&oacute;n/profesi&oacute;n, luego se presiona el bot&oacute;n "Guardar" para registrar los datos ingresados.</p>

        <p><center><img src="ocupaciondos.png" height="323" width="742"></center></p>


	<p align="justify">El bot&oacute;n "Cancelar" borra lo ingresado en el campo nombre y aparece el panel b&uacute;squeda. </p>

<p align="justify">
	Para realizar una b&uacute;squeda de una ocupaci&oacute;n o profesi&oacute;n se debe seleccionar una opci&oacute;n de b&uacute;squeda, estas son por n&uacute;mero o por nombre de ocupaci&oacute;n o profesi&oacute;n y presionar el bot&oacute;n "Buscar", si la b&uacute;squeda arrojo resultados se completara la tabla con los mismos.</p>

	<p align="justify">Para editar o eliminar una ocupaci&oacute;n o profesi&oacute;n se debe buscar y seleccionar con doble clic la que se desea modificar o eliminar. El bot&oacute;n "editar" habilita el campo nombre para modificar su contenido y el bot&oacute;n "eliminar" borra el registro seleccionado. </p>

	<p><center><img src="ocupaciontres.png" height="523" width="743"></center></p>

	<p align="justify">Al presionar el bot&oacute;n "Informe" aparece la siguiente ventana que nos permite obtener un listado con todas las ocupaciones/Profesiones registradas o filtrar el listado seg&uacute;n una descripci&oacute;n.</p>

<p align="justify">
Los datos requeridos para generar el listado son <i><b>Ordenar por</b></i> un campo que se mostrara en el listado, el <i><b>tipo de ordenamiento</b></i> del campo elegido y la cantidad de registros ha <i><b>mostrar</b></i>.
</p>

	<p><center><img src="ocupacionlistado.png" height="486" width="546"></center></p>

	<p align="justify">Al seleccionar el bot&oacute;n "Ver" aparece el listado. En el siguiente ejemplo no se ha filtrado el listado por una descripci&oacute;n.</p>

	<p><center><img src="listadoocupaciones.png" height="618" width="995"></center></p>

</font>


	</div>
    </body>
</html>